modules_cxf_src_test_java_org_mule_module_cxf_ProxyTestCase.java/[CN]/ProxyTestCase/[MT]/testProxyWithIntermediateTransform()/body

{
  String msg="<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">" + "<soap:Body><greetMe xmlns=\"http://apache.org/hello_world_soap_http/types\"><requestType>Dan</requestType></greetMe>" + "</soap:Body>"+ "</soap:Envelope>";
  MuleClient client=new MuleClient(muleContext);
  MuleMessage result=client.send("http://localhost:" + getPorts().get(0) + "/services/transform-proxy",msg,null);
  String resString=result.getPayloadAsString();
  assertTrue(resString.indexOf("greetMeResponse") != -1);
}
